#include "stdafx.h"
#include"StartScreen.h"
#include"Utils.h"
#include<stdio.h>
#include<stdlib.h>

void StartScreen::Welcome(void)    //»¶Ó­½çÃæ
{
	printf("                                                                                "); utils.color(13);
	printf(" ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ ");
	printf("                                                                                ");
	printf("                                                                                "); utils.color(14);
	printf("                                                                                ");
	printf("  ¡ö¡ö¡ö¡ö¡ö    ¡ö¡ö¡ö        ¡ö¡ö      ¡ö¡ö¡ö      ¡ö¡ö       ¡ö  ¡ö¡ö¡ö¡ö¡ö¡ö ");
	printf("¡ö¡ö¡ö¡ö¡ö¡ö¡ö  ¡ö¡ö¡ö¡ö      ¡ö¡ö    ¡ö¡ö¡ö¡ö¡ö    ¡ö¡ö      ¡ö   ¡ö¡ö¡ö¡ö¡ö¡ö ");
	printf("¡ö¡ö¡ö  ¡ö¡ö¡ö  ¡ö¡ö ¡ö¡ö     ¡ö¡ö   ¡ö¡ö    ¡ö¡ö   ¡ö¡ö    ¡ö     ¡ö¡ö         ");
	printf("¡ö¡ö¡ö          ¡ö¡ö  ¡ö¡ö    ¡ö¡ö  ¡ö¡ö      ¡ö¡ö  ¡ö¡ö  ¡ö       ¡ö¡ö         ");
	printf("  ¡ö¡ö¡ö¡ö      ¡ö¡ö   ¡ö¡ö   ¡ö¡ö  ¡ö¡ö      ¡ö¡ö  ¡ö¡ö ¡ö        ¡ö¡ö¡ö¡ö¡ö¡ö ");
	printf("   ¡ö¡ö¡ö¡ö¡ö   ¡ö¡ö    ¡ö¡ö  ¡ö¡ö  ¡ö¡ö¡ö¡ö¡ö¡ö¡ö  ¡ö¡ö¡ö         ¡ö¡ö¡ö¡ö¡ö¡ö ");
	printf("        ¡ö¡ö¡ö  ¡ö¡ö     ¡ö¡ö ¡ö¡ö  ¡ö¡ö¡ö¡ö¡ö¡ö¡ö  ¡ö¡ö ¡ö        ¡ö¡ö         ");
	printf("¡ö¡ö¡ö  ¡ö¡ö¡ö  ¡ö¡ö      ¡ö¡ö¡ö¡ö  ¡ö¡ö      ¡ö¡ö  ¡ö¡ö   ¡ö      ¡ö¡ö         ");
	printf("¡ö¡ö¡ö¡ö¡ö¡ö¡ö  ¡ö¡ö        ¡ö¡ö¡ö  ¡ö¡ö      ¡ö¡ö  ¡ö¡ö     ¡ö    ¡ö¡ö¡ö¡ö¡ö¡ö ");
	printf("  ¡ö¡ö¡ö¡ö¡ö    ¡ö¡ö          ¡ö¡ö  ¡ö¡ö      ¡ö¡ö  ¡ö¡ö      ¡ö¡ö ¡ö¡ö¡ö¡ö¡ö¡ö ");
	printf("                                                                                ");
	printf("                                                                                "); utils.color(13);
	printf("~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ "); utils.color(10);
	printf("¡¾»¶Ó­Ê¹ÓÃC++ÓïÑÔÌ°³ÔÉßÓÎÏ·¡¿!\n");
	system("pause");
	system("cls");
}